WB/src/Documents/ЗаказыПокупателей/ЗаказыПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказыПокупателей</name>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДКорзиныПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДСтикера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КарточкаТовара</name>
    <type>
      <types>CatalogRef.КарточкиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Округ</name>
    <type>
      <types>CatalogRef.Округа</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставка</name>
    <type>
      <types>DocumentRef.Поставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Продавцы</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>CatalogRef.РазмерыКарточекТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаWBПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаПродавцаПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтгрузки</name>
    <type>
      <types>CatalogRef.СкладыWB</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданНаОсновании</name>
    <type>
      <types>DocumentRef.ОтчетРеализации</types>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.Страны</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.ТипыСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаБезСкидок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаСоСкидками</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаСоСкидкойПродавца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДоговорПоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДоговорРеализации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

WB/src/InformationRegisters/СтатьиДРВЗаказах/СтатьиДРВЗаказах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатьиДРВЗаказах</name>
  <resources>
    <name>ЗаказОтменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиWB</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WB/src/Documents/Поставки/Поставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Поставки</name>
  <registerRecords>AccumulationRegister.СебестоимостьПартий</registerRecords>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Продавцы</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузкиПлановая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузкиФактическая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоставки</name>
    <type>
      <types>EnumRef.ТипыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоштучнаяПалета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>КарточкаТовара</name>
      <type>
        <types>CatalogRef.КарточкиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>CatalogRef.РазмерыКарточекТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВПоставке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВУпаковке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаРаскладке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоступилоВПродажу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗакупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗакупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WB/src/Catalogs/КарточкиТоваров/КарточкиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КарточкиТоваров</name>
  <owners>Catalog.Продавцы</owners>
  <attributes>
    <name>АртикулWB</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АртикулПродавца</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдОбъединеннойКарточки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдВнутренний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяКодМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодМаркировкиНанесен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОптовыеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Медиафайлы</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыМедиафайлов</types>
      </type>
    </attributes>
    <attributes>
      <name>URL</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Ид</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ярлыки</name>
    <attributes>
      <name>Ид</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

WB/src/Documents/ЗаказыПокупателей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВыбратьДатуПоследнегоДокумента(Продавец) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказыПокупателей.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказыПокупателей КАК ЗаказыПокупателей
	|ГДЕ
	|	ЗаказыПокупателей.Продавец = &Продавец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Продавец", Продавец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Дата;
	
КонецФункции

Процедура ЗагрузитьВсе() Экспорт
	
	Продавцы = Справочники.Продавцы.ВыбратьВсехПродавцов();
	
	Для Каждого Продавец Из Продавцы Цикл
		ЗагрузитьПоПродавцу(Продавец);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьПоПродавцу(Продавец) Экспорт
	
	НачалоПериода = ПолучитьНачалоПериодаЗагрузки(Продавец);
	Загрузить(Продавец, НачалоПериода);
	
КонецПроцедуры

Процедура Загрузить(Продавец, НачалоПериода) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(НачалоПериода, Тип("Дата"));
	
	Токен = Справочники.Продавцы.ПолучитьТокен(Продавец);
	ДанныеAPI = ЗаказыПокупателейAPI.ПолучитьВсеЗаказы(Токен, НачалоПериода);
	
	Если ДанныеAPI = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеAPIЗаказ Из ДанныеAPI Цикл
		ОбновитьИлиСоздать(Продавец, ДанныеAPIЗаказ);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПоДетализацииОтчетаРеализации(СтрДетализации, ОтчетРеализации, Продавец) Экспорт

	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(СтрДетализации, Тип("ДокументТабличнаяЧастьСтрока.ОтчетРеализации.Детализация"));

	Если Не ЗначениеЗаполнено(СтрДетализации.ИдЗаказа) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = НайтиПоРеквизиту("ИДЗаказа", СтрДетализации.ИдЗаказа);

	Если Не ЗначениеЗаполнено(Результат) Тогда

		Выборка = РегистрыСведений.СтатьиДРВЗаказах.ВыбратьПоСтатье(СтрДетализации.Статья);
		
		Если ЗначениеЗаполнено(Выборка) Тогда
			Результат = СоздатьНаОснованииДетализацииОтчетаРеализации(СтрДетализации, ОтчетРеализации, Продавец, Выборка.ЗаказОтменен);			
		КонецЕсли;
		
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция СоздатьНаОснованииДетализацииОтчетаРеализации(СтрДетализации, ОтчетРеализации, Продавец, ЗаказОтменен) Экспорт
	
	ПроверкаЗначенийКлиентСервер.ПроверитьЗначениеЗаполнено(СтрДетализации, Тип("ДокументТабличнаяЧастьСтрока.ОтчетРеализации.Детализация"));
	
	Объект = СоздатьДокумент();
	Объект.СозданНаОсновании = ОтчетРеализации;
	Объект.Продавец = Продавец;
	Объект.Отменен = ЗаказОтменен;
	Объект.Дата = СтрДетализации.ДатаВремяЗаказа;
	Объект.ДатаОбновления = СтрДетализации.ДатаВремяЗаказа;
	Объект.ИДЗаказа = СтрДетализации.ИДЗаказа;
	Объект.ИДКорзиныПокупателя = СтрДетализации.ИдКорзиныЗаказа;
	Объект.КарточкаТовара = СтрДетализации.КарточкаТовара;
	Объект.Поставка = СтрДетализации.Поставка;
	Объект.Размер = СтрДетализации.Размер;
	Объект.СкладОтгрузки = СтрДетализации.Склад;
	Объект.Страна = СтрДетализации.СтранаПродажи;
	Объект.ЦенаБезСкидок = СтрДетализации.ЦенаРозничная;
	Объект.ЦенаСоСкидкойПродавца = СтрДетализации.ЦенаРозничнаяСоСкидкой;
	
	Объект.Записать();
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = "Создан " + Объект;
	СообщениеПользователю.КлючДанных = Объект.Ссылка;
	СообщениеПользователю.Сообщить();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(Продавец, ДанныеAPIЗаказ)
	
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту("ИдЗаказа", ДанныеAPIЗаказ.ИдЗаказа);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьДокумент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Продавец = Продавец;
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPIЗаказ);
	
	Объект.Записать();
	Возврат Объект;
	
КонецФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPIЗаказ)
	
	Объект.Дата = ДанныеAPIЗаказ.Дата;
	Объект.Отменен = ДанныеAPIЗаказ.Отменен;
	Объект.ДатаОтмены = ДанныеAPIЗаказ.ДатаОтмены;
	Объект.ДатаОбновления = ДанныеAPIЗаказ.ДатаОбновления;
	Объект.КарточкаТовара = Справочники.КарточкиТоваров.НайтиПоРеквизиту("АртикулWB", ДанныеAPIЗаказ.АртикулWB, , Объект.Продавец);
	Объект.Размер = Справочники.РазмерыКарточекТоваров.НайтиПоРеквизиту("Размер", ДанныеAPIЗаказ.Размер, , Объект.КарточкаТовара);
	Объект.Поставка = Документы.Поставки.НайтиПоИдПоставки(ДанныеAPIЗаказ.ИдПоставки);
	Объект.СкладОтгрузки = Справочники.СкладыWB.НайтиПоНаименованию(ДанныеAPIЗаказ.СкладОтгрузки, Истина);
	Объект.ТипСклада = Перечисления.ТипыСкладов.ПолучитьПоНаименованию(ДанныеAPIЗаказ.ТипСклада);
	Объект.Страна = Справочники.Страны.ПолучитьПоНаименованию(ДанныеAPIЗаказ.Страна);
	Объект.Округ = Справочники.Округа.ПолучитьПоНаименованию(ДанныеAPIЗаказ.Округ);
	Объект.Регион = Справочники.Регионы.ПолучитьПоНаименованию(ДанныеAPIЗаказ.Регион);
	Объект.ЭтоДоговорПоставки = ДанныеAPIЗаказ.ЭтоДоговорПоставки;
	Объект.ЭтоДоговорРеализации = ДанныеAPIЗаказ.ЭтоДоговорРеализации;
	Объект.ЦенаБезСкидок = ДанныеAPIЗаказ.ЦенаБезСкидок;
	Объект.СкидкаПродавцаПроцент = ДанныеAPIЗаказ.СкидкаПродавцаПроцент;
	Объект.СкидкаWBПроцент = ДанныеAPIЗаказ.СкидкаWBПроцент;
	Объект.ЦенаСоСкидками = ДанныеAPIЗаказ.ЦенаСоСкидками;
	Объект.ЦенаСоСкидкойПродавца = ДанныеAPIЗаказ.ЦенаСоСкидкойПродавца;
	Объект.ИДСтикера = ДанныеAPIЗаказ.ИДСтикера;
	Объект.ИДКорзиныПокупателя = ДанныеAPIЗаказ.ИДКорзиныПокупателя;
	Объект.ИДЗаказа = ДанныеAPIЗаказ.ИДЗаказа;
	
КонецПроцедуры

Функция ПолучитьНачалоПериодаЗагрузки(Продавец)
	
	ДатаПоследнегоДокумента = ВыбратьДатуПоследнегоДокумента(Продавец);
	
	Если ДатаПоследнегоДокумента <> Неопределено Тогда
		Возврат ДатаПоследнегоДокумента;
	КонецЕсли;
	
	Возврат Справочники.Продавцы.ПолучитьДатуРегистрации(Продавец);

КонецФункции

#КонецОбласти

#КонецЕсли
